app/controllers/data_file_controller.rb

SELECT `data_files`.* FROM `data_files` WHERE (`data_files`.`md5` = '') LIMIT 1
---
  def image

    @dfile = DataFile.find_by_md5(params[:md5])