app/controllers/stream_controller.rb

SELECT `streams`.* FROM `streams` WHERE (`streams`.`name` = 'show') LIMIT 1
INSERT INTO `streams` (`created_at`, `name`, `updated_at`) VALUES ('2010-09-29 01:23:08', 'show', '2010-09-29 01:23:08')
---
  def show

    # TODO hackish
    stream_name = (params[:stream_name] == 'show') ? params[:stream_name2] : params[:stream_name]

    @stream = Stream.find_by_name(stream_name)
    if !@stream
      @stream = Stream.new(params[:stream])
      @stream.name = stream_name
      @stream.save!