app/controllers/user_sessions_controller.rb

  def destroy
    @user_session = UserSession.find
    @user_session.destroy
---
DELETE FROM `users` WHERE (`users`.`id` = 1)