app/controllers/users_controller.rb

INSERT INTO `users` (`created_at`, `crypted_password`, `current_login_at`, `current_login_ip`, `email`, `failed_login_count`, `last_login_at`, `last_login_ip`, `login_count`, `password_salt`, `perishable_token`, `persistence_token`, `single_access_token`, `updated_at`, `username`) VALUES ('2010-09-17 21:42:11', 'ca08e51808d6bb68ebea679be925da8eb8e4e340b18a74e7ee5430dc88e350614b5298b50a0e207e3466555644b8f71fa0978b04a965dd24811bf21e2ab5b420', NULL, NULL, 'marcjc@gmail.com', 0, NULL, NULL, 0, 'HMjUV6PNGN1T6dz76BB', 'VbOHLJ0tTlKkhQjTSLl', '55ca3503892178d7c175363e44862a2d6bb40eb3fab3ed72f634292ad32f79eb4901727b497a09e8b9d934bd83a7dd9bff546a77cea668ac0dadaf3ce0662db3', 'XSUBc2fXzJWsF3sJrrpA', '2010-09-17 21:42:11', 'Juul')
---
  def create
    @user = User.new(params[:user])
    if @user.save

SELECT `users`.* FROM `users` WHERE (`users`.`id` = 4) LIMIT 1
UPDATE `users` SET `perishable_token` = 'Rnbfwndnf9UsHyAjpihZ', `updated_at` = '2010-09-17 23:05:29', `username` = 'Juul2' WHERE (`users`.`id` = 4)
---
  def update
    @user = User.find(params[:id])
    if @user.update_attributes(params[:user])